import 'package:tec/data_models.dart';
import 'package:tec/gen/assets.gen.dart';

Map homePagePosterMap = {
  "imageAsset": Assets.images.posterTest.path,
  "writer": "ملیکا عزیزی",
  "date": "یک روز پیش",
  "title": "دوازده قدم برنامه نویسی یک دوره",
  "View": "251",
};

List<HashTagModel> tagList = [
  HashTagModel(title: 'جاوا'),
  HashTagModel(title: 'کاتلین'),
  HashTagModel(title: 'وب'),
  HashTagModel(title: 'هوش مصنوعی '),
  HashTagModel(title: 'iot'),
  HashTagModel(title: 'دارت'),
];
List<HashTagModel>selectedTags=[];
List<BlogModel> blogList = [
  BlogModel(
    id: 1,
    imageUrl:
        'https://static.digiato.com/digiato/2025/03/Evaldas-Rimasauskas-2-910x600.jpg.webp',
    title:
        ' این مرد با ارسال فاکتورهای جعلی ۱۲۲ میلیون دلار از گوگل و فیس‌بوک کلاهبرداری کرد',
    writer: 'حمید گنجی',
    writerImageUrl:
        'https://secure.gravatar.com/avatar/543b1aed764bdffdf1e881f0d1ec5a36?s=32&r=g',
    date: '1 ساعت پیش',
    content: """
یک مرد لیتوانیایی با روشی عجیب و ساده توانست مجموعاً ۱۲۲ میلیون دلار از غول‌های سیلیکون‌ولی کلاهبرداری کند. این فرد با ارسال فاکتورهای جعلی به دو شرکت فیس‌بوک (متا کنونی) و گوگل بین سال‌های ۲۰۱۳ تا ۲۰۱۵ توانست مبلغ هنگفتی را از این دو شرکت دریافت کند Evaldas Rimasauskas از لیتوانی و همدستان او بین سال‌های ۲۰۱۳ تا ۲۰۱۵ فاکتورهایی جعلی به فیس‌بوک و گوگل ارسال کردند و توانستند ۹۹ میلیون دلار از فیس‌بوک و ۲۳ میلیون دلار از گوگل سرقت کنند. نحوه کار او نیز بسیار ساده ولی هوشمندانه بود. این شخص فاکتورهایی را برای مواردی که این شرکت‌ها سفارش نداده بودند ارسال می‌کرد و در کمال تعجب، آن‌ها این فاکتورها را پرداخت می‌کردند.

البته Evaldas Rimasauskas سرانجام به دام افتاد و به کلاهبرداری از دو غول سیلیکون‌ولی اعتراف کرد. اما روش کار او و البته سهل‌انگاری مسئولین حسابداری دو شرکت فیس‌بوک و گوگل در نوع خود بسیار جالب‌توجه است.

Evaldas Rimasauskas برای کاهش ریسک، فاکتورهای جعلی خود را همراه با انواع اسناد جعلی، ازجمله قراردادها و نامه‌های امضا شده جعلی از طریق ایمیل برای این شرکت‌ها ارسال می‌کرد. او حتی ایمیل‌هایی را جعل می‌کرد که نشان می‌داد مدیران ارشد این شرکت‌ها از پرداخت این ارقام به او حمایت می‌کنند.

این فاکتورهای جعلی با سربرگ شرکت Quanta Computer Inc که در تایوان مستقر است برای فیس‌بوک و گوگل ارسال می‌شدند. این شرکت در زمینه تولید قطعات الکترونیکی فعالیت می‌کند. Evaldas Rimasauskas حتی شرکتی با همین نام در لیتوانی به ثبت رساند تا ریسک‌ها را به حداقل برساند.

برنامه او به حدی دقیق بود که شرکت‌های فیس‌بوک و گوگل حتی صحت فاکتورهای ارسالی از سوی او را بررسی نکردند. این کلاهبردار سپس پول‌های واریز شده را به حساب‌هایی در قبرس، لیتوانی، مجارستان، اسلواکی و لتونی منتقل می‌کرد.

این کلاهبرداری سرانجام توسط گوگل کشف و Evaldas Rimasauskas با اتهاماتی مانند کلاهبرداری، سرقت هویت و پول‌شویی مواجه شد. همچنین در دسامبر ۲۰۱۹ دادگاه آمریکا این کلاهبردار را به تحمل ۵ سال حبس و جریمه‌ای ۵۰ میلیون‌دلاری محکوم کرد.

""",
    views: '256',
  ),
  BlogModel(
    id: 2,
    imageUrl:
        'https://static.digiato.com/digiato/2025/03/nvidia-910x600.jpg.webp',
    title:
        'نویدیا تصمیم دارد طی چهار سال آینده تولید تراشه‌ها را در آمریکا گسترش دهد و زنجیره تأمین خود را از آسیا به آمریکا منتقل کند',
    writer: 'جواد ناجی',
    writerImageUrl:
        'https://digiato.com/wp-content/uploads/avatars/224206-32x32.jpg',
    date: '2 روز پیش',
    content:
        """نویدیا که سال 1993 تأسیس شده، طی چند سال گذشته به واسطه هوش مصنوعی رشد زیادی کرده و ارزش آن به 2.9 تریلیون دلار رسیده است. اما در سال‌های اخیر این شرکت و دیگر شرکت‌های بزرگ فناوری ایالات متحده مانند اپل، بیش از پیش به مراکز تولید تراشه تایوان وابسته شده‌اند که توسط شرکت‌های TSMC و Foxconn اداره می‌شود.

زنجیره تأمین تایوان در معرض تهدید جنگ‌های تجاری و طرح‌های ارضی چین قرار دارد که آن را بخشی از خاک خود می‌داند.

با اشاره به این چالش‌ها، هوانگ اعلام کرده که انویدیا به خوبی برای مقابله با مشکلات تایوان که همچنین در معرض خطر زلزله است، آماده است. او در ادامه می‌گوید:

«درحال‌حاضر می‌دانیم که می‌توانیم در ایالات متحده تولید کنیم و زنجیره تأمین ما به اندازه کافی متنوع است.»

هوانگ همچنین در بخشی از سخنان خود گفته که باور دارد دولت ترامپ می‌تواند در تقویت صنعت هوش مصنوعی ایالات متحده در زمان رقابت فزاینده با چین مؤثر واقع شود.     """,
    views: '300',
  ),

  BlogModel(
    id: 3,
    imageUrl:
        'https://static.digiato.com/digiato/2025/03/google-910x600.jpg.webp',
    title:
        'گوگل برای حل یک پرونده مربوط به تبعیض نژادی 28 میلیون دلار پرداخت می‌کند',
    writer: 'جواد تاجی',
    writerImageUrl:
        'https://digiato.com/wp-content/uploads/avatars/224206-64x64.jpg',
    date: '3 روز پیش',
    content:
        """براساس گزارش بی‌بی‌سی، غول فناوری هرچند اتهامات مطرح شده را رد کرده است اما تایید کرده که در مرحله «توافق‌ حل و فصل» قرار دارد. این پرونده در سال 2021 توسط «آنا کانتو»، کارمند سابق گوگل، مطرح شد و او ادعا کرد که کارکنان دارای پیشینه‌های اسپانیایی، لاتین، بومیان آمریکا و سایر گروه‌های قومی با حقوق و سطوح شغلی پایین‌تری نسبت به همکاران سفیدپوست و آسیایی خود شروع به کار کرده‌اند.

توافق‌نامه مذکور توسط قاضی «چارلز آدامز» از دادگاه عالی شهرستان سانتا کلارا در کالیفرنیا به تایید اولیه رسیده است. همچنین پرونده خانم کانتو علیه گوگل بر اساس یک سند داخلی مطرح شده که نشان می‌دهد کارکنان برخی پیشینه‌های قومی برای کار مشابه، دستمزد کمتری دریافت کرده‌اند.

به گفته وکلای خانم کانتو، روش تعیین حقوق اولیه و سطح شغلی بر اساس حقوق قبلی، نابرابری‌های تاریخی مبتنی بر نژاد و قومیت را تقویت کرده است. این پرونده جمعی برای حداقل 6632 نفر که بین 15 فوریه 2018 تا 31 دسامبر 2024 در گوگل مشغول به کار بودند، مطرح شده است.""",
    views: '350',
  ),
  BlogModel(
    id: 4,
    imageUrl:
        'https://static.digiato.com/digiato/2025/03/elon-musk-startup-zip2-3-1-910x600.jpg.webp',
    title:
        'نگاهی به اولین استارتاپ ایلان ماسک؛ Zip2 راه را برای گوگل مپس هموار کرد',
    writer: 'آزاد کبیری',
    writerImageUrl:
        'https://digiato.com/wp-content/uploads/avatars/290164-32x32.jpeg',
    date: '3 روز پیش',
    content:
        """این شرکت ابتدا با نام «Global Link Information Network» ثبت شد و با بودجه‌ای محدود آغاز به کار کرد. سپس از سرمایه‌گذاران مختلف و کمک‌های گرگ کوری تأمین شد. همچنین طبق گزارش‌ها ایلان ماسک ظاهراً مقداری کمک مالی نیز از پدرش برای تأسیس این استارتاپ گرفته بود، هرچند میزان دقیق آن مشخص نیست.

اولین استارتاپ ایلان ماسک
طبق مصاحبه‌های قدیمی ایلان ماسک درباره Zip2، روزهای اول این شرکت با کار سخت و محدودیت‌های مالی همراه بود. برادران ماسک در دفتر کارشان زندگی می‌کردند و در مراکز YMCA دوش می‌گرفتند؛ YMCA سازمانی غیرانتفاعی و جهانی است که هدف اصلی آن کمک به جوانان بود تا در شهرهای بزرگ از امکانات مناسب برای زندگی و پیشرفت برخوردار شوند. همچنین ایلان شخصاً بیشتر کدنویسی پلتفرم زیپ2 را با استفاده از زبان‌های C و C++ انجام داد تا لیست کسب‌وکارها را با فناوری نقشه‌برداری ترکیب کند.

باوجود این تلاش‌ها، زیپ2 ابتدا در جذب مشتری موفق نبود. محصول اولیه ساده و اغلب کُند بود اما پس از مدتی Zip2 هم از نظر مالی و هم از نظر فرهنگی موفقیت بزرگی کسب کرد. طبق گزارش‌ها، فوریه 1999 شرکت کامپک کامپیوتر (Compaq Computer Corporation) زیپ2 را 307 میلیون دلار نقدی و سهام خریداری کرد. این معامله یکی از بزرگ‌ترین خریدهای آن زمان محسوب می‌شد. ایلان ماسک شخصاً 22 میلیون دلار از فروش این شرکت به دست آورد که منابع مالی لازم برای تأسیس شرکت بعدی خود، X.com ( پی‌پال فعلی)، را فراهم کرد. آن سال ایلان ماسک فقط 27 سال داشت.

اکنون شاید کمتر کسی نام Zip2 را شنیده باشد، نمی‌توان تأثیر آن را بر پلتفرم‌هایی مانند گوگل مپس و ویز نادیده گرفت. """,
    views: "338",
  ),
];
 
 List<HottestPodcasts>hottestPodcasts=[
  HottestPodcasts(id: 1,
   imageUrl:'https://static.digiato.com/digiato/2025/02/Untitled-design-85-910x600.jpeg.webp',
    title: 'آب شیرین کن'),
    HottestPodcasts(id: 2,
     imageUrl: 'https://static.digiato.com/digiato/2025/02/1122-910x600.jpg.webp',
      title: 'باتری اتمی'),
       HottestPodcasts(id: 3,
     imageUrl: 'https://static.digiato.com/digiato/2025/01/UAE-Plant-910x600.jpg.webp',
      title: 'نیروگاه خورشیدی'), 
      HottestPodcasts(id: 4,
     imageUrl: 'https://static.digiato.com/digiato/2025/03/black-hole-910x600.jpg.webp',
      title: 'سیاه چاله'),
 ];